handlers/product-switch-api/test/fixtures/subscription.json

{
  "success": true,
  "id": "8a1295998f51a921018f5be20c7b2975",
  "accountId": "8a1295998f51a921018f5be20a7d296e",
  "accountNumber": "A02071906",
  "accountName": "0015I00000I3Ty1QAF",
  "invoiceOwnerAccountId": "8a1295998f51a921018f5be20a7d296e",
  "invoiceOwnerAccountNumber": "A02071906",
  "invoiceOwnerAccountName": "0015I00000I3Ty1QAF",
  "subscriptionNumber": "A-S02138089",
  "version": 1,
  "revision": "1.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2024-05-09",
  "serviceActivationDate": "2024-05-09",
  "customerAcceptanceDate": "2024-05-09",
  "subscriptionStartDate": "2024-05-09",
  "subscriptionEndDate": "2025-05-09",
  "lastBookingDate": "2024-05-09",
  "termStartDate": "2024-05-09",
  "termEndDate": "2025-05-09",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "EUR",
  "contractedMrr": 4.17,
  "totalContractedValue": 50,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "ac69d3a2-2dd4-e931-0000-0000000107ef",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a1295998f51a921018f5be20c922977",
      "productId": "2c92a0fe5aacfabe015ad24bf6e15ff6",
      "productName": "Contributor",
      "productSku": "ABC-00000028",
      "productRatePlanId": "2c92a0fc5e1dc084015e37f58c200eea",
      "productRatePlanNumber": "PRP-00000109",
      "ratePlanName": "Annual Contribution",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05329384",
      "ratePlanCharges": [
        {
          "id": "8a1295998f51a921018f5be20cab297b",
          "originalChargeId": "8a1295998f51a921018f5be20cab297b",
          "productRatePlanChargeId": "2c92a0fc5e1dc084015e37f58c7b0f34",
          "number": "C-05575925",
          "name": "Annual Contribution",
          "productRatePlanChargeNumber": "PRPC-00000177",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "prorationOption": null,
          "isStackedDiscount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-05-09",
          "effectiveEndDate": "2025-05-09",
          "processedThroughDate": "2024-05-09",
          "chargedThroughDate": "2025-05-09",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 4.166666667,
          "dmrc": 4.166666667,
          "tcv": 50,
          "dtcv": 50,
          "originalOrderDate": "2024-05-09",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "EUR50",
          "price": 50,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2024-05-09",
      "endDate": "2025-05-09",
      "status": "Active"
    },
    {
      "startDate": "2025-05-09",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2024-05-09 06:44:52",
  "updateTime": "2024-05-09 06:44:52"
}